
/**
 * ==================================================
 * 正则表达式及对应的默认错误提示信息
 * 填写要求：一行定义正则表达式，一行定义该正则表达式默认的错误提示信息。
 * KEY值不能重复，否则会出现覆盖。添加之前请先确认KEY值不存在。
 * add by lanjh 2015/10/30
 * ==================================================
 */

// 金额格式校验
checkRegExp["amount"] = "^\\d+(\\.\\d{1,2})?$";
errorMessage["amount"] = "对不起，输入的金额必须大于0，小数点后最多允许输入2位数字！";

// 纯数字格式校验
checkRegExp["number"] = "^\\d+$";
errorMessage["number"] = "对不起，您只能输入数字，请勿输入非数字的字符！";

// 电子邮箱Email格式校验
checkRegExp["email"] = "^[\\w-]+(\\.[\\w-]+)*@([\\w-]+\\.)+[\\w-]$";
errorMessage["email"] = "对不起，您输入的电子邮箱格式不正确！正确的电子邮箱格式为：X@X.X。";

// 只允许数字、大小写字母
checkRegExp["letterNumber"] = "^[a-zA-Z0-9]*$";
errorMessage["letterNumber"] = "对不起，不符合格式要求！您可以输入数字、大小写字母。";

// 只允许中文，包括繁体中文
checkRegExp["onlyChinese"] = "^[\\u4e00-\\u9fa5]*$";
errorMessage["onlyChinese"] = "对不起，不符合中文格式要求！您可以输入简体中文、繁体中文。";

// 只允许数字、大小写字母、简体中文、繁体中文
checkRegExp["letterNumberChinese"] = "^[a-zA-Z0-9\\u4e00-\\u9fa5]*$";
errorMessage["letterNumberChinese"] = "对不起，不符合格式要求！您可以输入数字、大小写字母、简体中文、繁体中文。";

// 日期格式校验，只允许格式为yyyy-MM-dd日期
checkRegExp["date"] = "(([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)";
errorMessage["date"] = "对不起，日期格式不正确！正确的格式为：yyyy-MM-dd。";

// 校验特殊符号
checkRegExp["specialChar"] = "(?!.*<|.*>|.*&|.*\")^.*$";
errorMessage["specialChar"] = "禁止输入非法字符";

